app/views/invoices/highest.html.erb

  <tbody>
    <% Invoice.order(amount: :desc).limit(5).each do |p| %>
---
SELECT  `invoices`.* FROM `invoices` ORDER BY `invoices`.`amount` DESC LIMIT 5