app/views/invoices/index.html.erb

      <strong>Total Invoices:</strong>
      <%= Invoice.all.size %>
---
SELECT  `invoices`.* FROM `invoices` ORDER BY created_at DESC LIMIT 1
SELECT COUNT(*) FROM `invoices`