app/controllers/invoices_controller.rb

SELECT `invoices`.* FROM `invoices` WHERE (created_at )
SELECT COUNT(*) FROM `invoices`
---
  def index
    @invoices = Invoice.all
    @total_amount = Invoice.where("created_at ").collect{|a| a["amount"]}.sum
    @total_invoices = Invoice.count

INSERT INTO `invoices` (`name`, `amount`, `tax`, `created_at`, `updated_at`, `total_amount`) VALUES ('Joye', 50000, 3, '2019-03-10 22:37:33', '2019-03-10 22:37:33', 61000)
---
  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save

UPDATE `invoices` SET `name` = 'Ram', `total_amount` = 191000, `updated_at` = '2019-03-10 22:57:15' WHERE `invoices`.`id` = 4
---
  def update
    respond_to do |format|
      if @invoice.update(invoice_params)

DELETE FROM `invoices` WHERE `invoices`.`id` = 1
---
  def destroy
    @invoice.destroy

SELECT  `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 11 LIMIT 1
---
    def set_invoice
      @invoice = Invoice.find(params[:id])