app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('anujvick801@gmail.com', '$2a$10$1W7YYrJ5wqZGfwoesCA2me02ytuecKfK5w5PDztdKfbrzVmRVwN8u', '2019-03-08 07:29:45', '2019-03-08 07:29:45')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$8XO3/aBYdlMTojbkEX.I5OI4m/Y7J1phkbfZi5yG51eG6XdZCgzvW', `updated_at` = '2019-03-08 07:30:29' WHERE `users`.`id` = 1