app/models/invoice.rb

    def record_total_amount
      self.total_amount = Invoice.sum(&:amount)
---
SELECT COUNT(*) FROM `invoices`
SELECT `invoices`.* FROM `invoices`